runs/stateful/full_paper/exp1_ttft_reduction_mistral_sglang/sglang_runs/mistralai_Mistral-7B-Instruct-v0.3/ctx4096_out64_a16_b8_s0/sglang_bench_raw.txt
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=14008, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', model='mistralai/Mistral-7B-Instruct-v0.3', served_model_name=None, tokenizer='mistralai/Mistral-7B-Instruct-v0.3', num_prompts=32, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=4096, random_output_len=64, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:14008/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=14008, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', model='mistralai/Mistral-7B-Instruct-v0.3', served_model_name=None, tokenizer='mistralai/Mistral-7B-Instruct-v0.3', num_prompts=32, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=4096, random_output_len=64, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)

#Input tokens: 68276
#Output tokens: 954
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 not set   
Successful requests:                     32        
Benchmark duration (s):                  3.14      
Total input tokens:                      68276     
Total input text tokens:                 68276     
Total generated tokens:                  954       
Total generated tokens (retokenized):    957       
Request throughput (req/s):              10.20     
Input token throughput (tok/s):          21767.37  
Output token throughput (tok/s):         304.15    
Peak output token throughput (tok/s):    846.00    
Peak concurrent requests:                32        
Total token throughput (tok/s):          22071.52  
Concurrency:                             28.78     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   2820.92   
Median E2E Latency (ms):                 2807.97   
P90 E2E Latency (ms):                    3078.47   
P99 E2E Latency (ms):                    3117.02   
---------------Time to First Token----------------
Mean TTFT (ms):                          1563.21   
Median TTFT (ms):                        1739.93   
P99 TTFT (ms):                           2578.36   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          76.56     
Median TPOT (ms):                        43.57     
P99 TPOT (ms):                           548.29    
---------------Inter-Token Latency----------------
Mean ITL (ms):                           43.65     
Median ITL (ms):                         9.19      
P95 ITL (ms):                            10.65     
P99 ITL (ms):                            1617.08   
Max ITL (ms):                            2462.18   
==================================================


  0%|          | 0/32 [00:00<?, ?it/s]
  3%|▎         | 1/32 [00:01<00:58,  1.90s/it]
  6%|▋         | 2/32 [00:02<00:35,  1.19s/it]
 31%|███▏      | 10/32 [00:02<00:03,  5.98it/s]
 53%|█████▎    | 17/32 [00:02<00:01, 11.41it/s]
 69%|██████▉   | 22/32 [00:02<00:00, 14.90it/s]
 84%|████████▍ | 27/32 [00:03<00:00, 19.19it/s]
100%|██████████| 32/32 [00:03<00:00, 10.24it/s]